# ██████████████████████████████████████████████████████
# ██                 ⚡ PYTHON MASTERCLASS            ██
# ██          Topic  : FUNCTIONS IN PYTHON            ██
# ██████████████████████████████████████████████████████



# ░▒▓█ ▶ 01 — INTRODUCTION █▓▒░
# ══════════════════════════════════════════════════════



"""
👉 reusable code block.
👉 Task perform
👉 Once defined, we can use multiple times.

"""

# ░▒▓█ ▶ 02 — WHY DO WE NEED THIS ? █▓▒░
# ══════════════════════════════════════════════════════



# ░▒▓█ ▶ 03 — BASIC SYNTAX █▓▒░
# ══════════════════════════════════════════════════════
#Creating a function

def functionname():
    print("Hello")
    print("Hello")
# Calling a function
functionname()


# ░▒▓█ ▶ 04 — SIMPLE EXAMPLE █▓▒░
# ══════════════════════════════════════════════════════

def welcome_function():
    print("Welcome")
    print("Welcome")
    print("Welcome")
    print("Welcome")
    print("Welcome")

welcome_function()
# ░▒▓█ ▶ 05 — PARAMETERS & ARGUMENTS █▓▒░
# ══════════════════════════════════════════════════════
def addition(a,b):
    print(a + b)
    print("Addition")

addition(2,3)
addition(6,8)  #Argument



# ░▒▓█ ▶ 06 — RETURN KEYWORD █▓▒░
# ══════════════════════════════════════════════════════
def addition(a=0,b=0):
    return (a + b)
    

addition_value = addition(3,10)
print(addition_value)


# ░▒▓█ ▶ 07 — DEFAULT PARAMETERS █▓▒░
# ══════════════════════════════════════════════════════



# ░▒▓█ ▶ 08 — MULTIPLE PARAMETERS █▓▒░
# ══════════════════════════════════════════════════════

def greeting(name,age,college):
    print(f"We welcome {name} of {age}  from {college}")


greeting(name="Gokul",age=23,college="Anna university")



# ░▒▓█ ▶ 09 — MINI CHALLENGE █▓▒░
# ══════════════════════════════════════════════════════
#Even or odd 

def check_even_odd(num):
    if num%2 == 0:
        return 'Even'
    else:
        return 'Odd'
    
for i in range(1,101):
    output = check_even_odd(i)
    print(f"the number {i} is {output}")


# ░▒▓█ ▶ 12 — SUMMARY & RECAP █▓▒░
# ══════════════════════════════════════════════════════
